//=============================================================================
//	Project			:	sht30
//	Version			:	V1.0
//	File				:	sht30.c
//	Author			:	eonegh
//	Date				:	2023-04-20
//	Controller	:	STM32F103C6T6
//	IDE					:	Keil uVision5 V5.36.0.0
//	Compiler		:	eonegh
//	Brief				:	温湿度传感器sht30采集数据
//=============================================================================

/******************************************************************************/
/* 引用的头文件（'#include'）                                                  */
/******************************************************************************/
#include "sht30.h" 	//温湿度传感器sht30采集数据

/******************************************************************************/
/* 本地变量的定义 ('static')                                                   */
/******************************************************************************/



/******************************************************************************/
/* 全局变量的定义 ('extern'、'static'、'volatile'、'const')                    */
/******************************************************************************/
float Temperature=0;
float Humidity=0;


/******************************************************************************/
/* 函数原型：全局 ('extern') ，本地 ('static')                                 */
/******************************************************************************/

/**
 ******************************************************************************
 ** \brief	:  MCU通过SHT30获取温湿度
 **
 ** \param	: i2c_devaddr：IIC从机设备地址
 **
 ** \retval	: 0：采集的温湿度错误，丢弃
 **						1：获取到合法的温湿度数据
 **
 ******************************************************************************
**/

u8 SHT30_ReadTempHum(u8 i2c_devaddr)
{
	u16 tem=0,hum=0;
	u16 buff[6]={0};

//下发《测量》指令
	IIC_Start();
	IIC_Send_Byte(i2c_devaddr<<1 | IIC_WRITECMD);//写7位I2C设备地址加0作为写取位,1为读取位
	IIC_Wait_Ack();
	IIC_Send_Byte(0x2C);
	IIC_Wait_Ack();
	IIC_Send_Byte(0x06);
	IIC_Wait_Ack();
	IIC_Stop();
	
//接收SHT30返回的温湿度数据	
	delay_ms(50);
	IIC_Start();
	IIC_Send_Byte(i2c_devaddr<<1 | IIC_READCMD);//写7位I2C设备地址加0作为写取位,1为读取位
	if(IIC_Wait_Ack()==0)
	{
		buff[0]=IIC_Read_Byte(1);
		buff[1]=IIC_Read_Byte(1);
		buff[2]=IIC_Read_Byte(1);
		buff[3]=IIC_Read_Byte(1);
		buff[4]=IIC_Read_Byte(1);
		buff[5]=IIC_Read_Byte(0);
		IIC_NAck();
		IIC_Stop();
	}
	
//SHT30返回的数据格式：温度高8位、温度低8位，温度校验值、湿度高8位、湿度低8位、湿度校验值
	tem = ((buff[0]<<8) | buff[1]);	//温度拼接
	hum = ((buff[3]<<8) | buff[4]);	//湿度拼接
	
//转换成摄氏温度
	Temperature	= 175.0 * tem / 65535 - 45;	//计算公式：T = -45 + 175 * tem / (2^16-1)
	Humidity		= 100.0 * hum / 65535	;			//计算公式：RH = hum*100 / (2^16-1)
	
	if((Temperature>=-20)&&(Temperature<=125)&&(Humidity>=0)&&(Humidity<=100))	return 1;//过滤错误数据
	else return 0;
}



/******************************************************************************/
/* EOF (not truncated)                                                        */
/******************************************************************************/
